#
# This is the user-interface definition of a Shiny web application. You can
# run the application by clicking 'Run App' above.
#
# Find out more about building applications with Shiny here:
#
#    http://shiny.rstudio.com/
#

library(shiny)
library(plotly)
library(DT)
library(shinycssloaders)
library(shinyjs)
library(shinybusy)

# Define UI for application that draws a histogram
shinyUI(fluidPage(
    useShinyjs(),
    tags$head(
        tags$meta(charset="UTF-8"),
        tags$link(rel = "stylesheet", type = "text/css", href = "style.css")
    ),
    
    tags$div(class="header bg-primary",
             tags$h1(class="text-center","Monitoring Dog Sterilization Program")
    ),
    
    tabsetPanel(
        tabPanel("Introduction",
                 tags$h2("ข้อมูลทั่วไป"),
                 
                 tags$h3("โครงการหลัก แบบจำลองการระบาดและการควบคุมโรคพิษสุนัขบ้าในสุนัข ในประเทศไทย (Epidemic and mitigation modeling of canine rabies outbreaks in Thailand)"),
                 
                 tags$h2("ที่มาและความสำคัญ (Importance of project)"),
                 tags$p("โรคพิษสุนัขบ้าเป็นโรคติดต่อจากสัตว์สู่คน ซึ่งการติดเชื้อจะนำไปสู่การเสียชีวิต โดยมีอัตราการตาย 100% จากข้อมูลในปี พ.ศ. 2560-2561 ประเทศไทยเกิดการระบาดของโรคพิษสุนัขบ้าและมีผู้เสียชีวิตที่เพิ่มขึ้นอย่างชัดเจน โดยเกิดการระบาดทั้งในคนและสัตว์โดยเฉพาะอย่างยิ่งการติดเชื้อในสุนัขมีอัตราการเกิดโรคสูงขึ้นเมื่อเทียบกับช่วงปีก่อนหน้า ทำให้หน่วยงานที่เกี่ยวข้องจึงต้องให้ความสำคัญกับการควบคุมการระบาดของโรคให้ลดลง ขณะเดียวกันก็เน้นการบูรณาการความรู้และประสบการณ์จากหลายภาคส่วน ตั้งเป้าหมายที่จะกำจัดโรคนี้ให้หมดไปจากประเทศไทยในอนาคต อย่างไรก็ตามสุนัขเป็นสัตว์พาหะที่สำคัญที่สุดในการแพร่กระจายเชื้อไวรัสนี้มายังคน ซึ่งข้อมูลเกี่ยวกับรูปแบบและพลวัตของการระบาดของโรคพิษสุนัขบ้าในสุนัขของประเทศไทยยังมีน้อยมาก การสร้างองค์ความรู้เกี่ยวกับแบบจำลองและการศึกษาวิจัยเชิงพื้นที่ทางระบาดวิทยาที่เกี่ยวข้องกับโรคพิษสุนัขบ้า จะช่วยให้การป้องกันและควบคุมโรคเป็นไปอย่างตรงจุดและช่วยเพิ่มประสิทธิภาพของกระบวนการควบคุมป้องกันโรคพิษสุนัขบ้า ซึ่งการจะสร้างความเข้าใจในเรื่องของพลวัตการระบาดของโรคได้นั้น จะต้องมีองค์ความรู้หลายแขนงที่เกี่ยวข้อง เช่น ความเข้าใจเกี่ยวกับพลวัตประชากร รูปแบบการเคลื่อนที่ของสุนัข รูปแบบและโอกาสของการแพร่กระจายของโรคพิษสุนัขบ้าบนพื้นฐานทางด้านระบาดวิทยา เหล่านี้เป็นเรื่องที่ต้องทำความเข้าใจและสร้างองค์ความรู้เพื่อใช้ในการสร้างแบบจำลองการระบาดและแบบจำลองเชิงนโยบายที่เหมาะสมกับสภาวะและสถานการณ์ที่ใกล้เคียงกับความเป็นจริงได้
                 "),
                 
                tags$h3("โรคพิษสุนัขบ้า (Rabies)"),
        tags$a(href="http://r36.ddc.moph.go.th/r36/content/index/1",
         "ที่มา: สำนักโรคติดต่อทั่วไป กรมควบคุมโรค กระทรวงสาธารณสุข"
         ),
        tags$p("ชาวบ้านทั่วไปรู้จักกันว่า โรคกลัวน้ำ เกิดจากเชื้อไวรัสชื่อ เรบี่ส์ไวรัส (Rabies Virus) มีรูปร่างคล้ายกระสุนปืน เมื่อเชื้อนี้เข้าสู่ร่างกายคนหรือสัตว์แล้วจะเดินทางไปตามเส้นประสาทเข้าสู่สมอง ที่สำคัญ เมื่อเกิดอาการขึ้นแล้วไม่สามารถรักษาให้หายได้ ต้องเสียชีวิตทุกราย แต่โรคนี้ป้องกันได้และสามารถทำให้หมดไปจากคนและสัตว์เลี้ยง ในหลายประเทศยังมีผู้เสียชีวิตในพื้นที่ที่ควบคุมโรคในสุนัขไม่ได้ ในปี พ.ศ. 2549 (ค.ศ.2006) กลุ่มสหวิชาชีพทั่วโรคได้ร่วมกันก่อตั้งองค์กรเพื่อการควบคุมโรคพิษสุนัขบ้า (Global Alliance for Rabies Control) ซึ่งต่อมาได้มีการกำหนดให้มีวันป้องกันโรคพิษสุนัขบ้าโลกขึ้นในเดือนกันยายน เพื่อกระตุ้นให้ประชาชนตื่นตัวต่อการควบคุมโรคพิษสุนัขบ้า มีความรู้ความเข้าใจในการเลี้ยงสุนัขและป้องกันควบคุมโรคพิษสุนัขบ้า ปัจจุบันองค์การอนามัยโลกและองค์การโรคระบาดสัตว์ระหว่างประเทศร่วมสนับสนุน พร้อมใจกันกำหนดให้วันที่ 28 กันยายนของทุกปี เป็นวันป้องกันโรคพิษสุนัขบ้าโลก ชื่อของโรคทำให้เข้าใจกันผิดคิดว่าโรคนี้เกิดกับสุนัขเท่านั้น แท้ที่จริงแล้วโรคนี้เกิดกับสัตว์เลือดอุ่นด้วย โดยเฉพาะสัตว์เลี้ยงลูกด้วยนมทุกชนิด เช่น แมว ชะนี ลิง กระรอก กระแต หนู ค้างคาว แม้แต่สัตว์เศรษฐกิจอย่าง วัว ควาย ม้า สุกร พบในตัวที่มีประวัติเคยถูกสุนัขบ้ากัดมาก่อน หรือสัตว์ป่าในเมืองไทยพบว่า สุนัขเป็นตัวแพร่เชื้อที่สำคัญมากที่สุด กว่า 95% ของผู้เสียชีวิตมีสาเหตุมาจากสุนัข รองมาคือ แมว"
        ),
        
        
        tags$h3("การติดต่อ­"),
        tags$p("สุนัขและแมวที่ป่วยด้วยโรคพิษสุนัขบ้า สามารถแพร่เชื้อได้ทางน้ำลาย เพราะเชื้อจะออกมาในน้ำลายเป็นระยะตั้งแต่ 1 – 7 วันก่อนแสดงอาการจนกระทั่งตาย คนเราจะติดเชื้อนี้ก็ต่อเมื่อ"
        ),
        tags$ol(type = "1",
                tags$li("ถูกสัตว์ที่เป็นโรคนี้กัดหรือข่วน"),
                tags$li("ถูกสัตว์ที่เป็นโรคนี้เลียหรือน้ำลายสัตว์กระเด็นเข้าแผลรอยขีดข่วนหรือ เยื่อบุเมือกบุตา จมูก ปาก (ถ้าน้ำลายถูกผิวหนังปกติ ไม่มีรอยข่วนหรือบาดแผล ไม่มีโอกาสติดโรค)"),
                tags$li("การติดต่อโดยการหายใจ มีโอกาสน้อยมาก ยกเว้นมีจำนวนไวรัสในอากาศเป็นจำนวนมาก เช่น ในถ้ำค้างคาว"),
                tags$li("การติดต่อโดยการกินเกิดขึ้นได้ยาก ไม่เคยมีรายงานตามธรรมชาติ เช่นเดียวกับการติดต่อจากคนไปสู่คน ในธรรมชาติก็ไม่เคยมีรายงานเช่นกัน"),
        ),
        
        
        tags$h3("ระยะฟักตัวของโรค"),
        tags$p(""),
        tags$ol(type = "1",
                tags$li("จำนวนเชื้อที่เข้าไป (บาดแผลใหญ่ ลึกหรือมีหลายแผล มีโอกาสที่เชื้อจะเข้าไปได้มาก)"),
                tags$li("ตำแหน่งที่เชื้อเข้าไป (ถ้าอยู่ใกล้สมองมากเชื้อก็จะเดินทางไปถึงสมองได้เร็วหรืออยู่ในที่มีปลายประสาทมาก เช่น มือหรือเท้า เชื้อก็จะเข้าสู่ระบบประสาทได้ง่าย)"),
                tags$li("อายุคนที่ถูกกัด (เด็กและคนชราจะมีความต้านทานของโรคต่ำกว่าคนหนุ่มสาว)"),
                tags$li("สายพันธุ์ของเชื้อ ถ้าเป็นสายพันธุ์จากสัตว์ป่า จะมีอาการรุนแรงกว่าสายพันธุ์จากสุนัข"),
        ),
        
        tags$h3("อาการที่พบในสัตว์"),
        tags$p("ส่วนใหญ่สุนัข แมว วัว ควาย มีระยะพักตัวไม่เกิน 6 เดือน"),
        tags$p("ระยะเริ่มแรก มีอาการประมาณ 2 – 3 วัน โดยสุนัขจะมีอารมณ์และอุปนิสัยเปลี่ยนไปจากเดิม เช่น สุนัขที่ชอบคลุกคลีกับเจ้าของ จะปลีกตัวออกไปหลบซุกตัวเงียบๆ มีอารมณ์หงุดหงิด ตัวที่เคยขลาดกลัวคนก็จะกลับมาคลอเคลีย เริ่มมีไข้เล็กน้อย ม่านตาขยายกว้างกว่าปกติ การตอบสนองต่อแสงของตาลดลง กินข้าวกินน้ำน้อยลง ลักษณะการเคี้ยวหรือกลืนผิดไป"),
        tags$p("ระยะตื่นเต้น คือ เริ่มมีอาการทางปราสาท สุนัขจะกระวนกระวาย ตื่นเต้น หงุดหงิด ไม่อยู่นิ่ง กัดแทะสิ่งของ สิ่งแปลกปลอม กัดทุกสิ่งไม่เลือกหน้า ถ้ากักขังหรือล่ามไว้จะกัดกรงหรือโซ่จนเลือดกบปาก โดยไม่เจ็บปวด เสียงเห่าหอนจะเปลี่ยนไป ตัวแข็ง"),
        tags$p("ระยะอัมพาต สุนัขจะมีคางห้อยตก ลิ้นมีสีแดงคล้ำห้อยออกนอกปาก น้ำลายไหลและไม่สามารถใช้ลิ้นได้เลย สุนัขอาจแสดงอาการขยอกหรือขย้อนคล้ายมีอะไรอยู่ในลำคอ ขาอ่อนเปลี้ยทรงตัวไม่ได้ ล้มลงแล้วลุกไม่ได้ อัมพาตขึ้นทั่วตัวอย่างรวดเร็วและตายในที่สุด อาการสุนัขบ้ามีทั้งแบบดุร้ายและแบบซึม"),
        
        tags$h3("อาการแสดงในสัตว์"),
        tags$p("สุนัข ที่แสดงอาการแบบดุร้าย จะแสดงอาการในระยะตื่นเต้นให้เห็นเด่นชัดและยาวนาน แต่จะแสดงอาการในระยะอัมพาตสั้นมากที่แสดงอาการแบบซึม จะแสดงอาการในระยะตื่นเต้นสั้นมากจนไม่ทันสังเกตเห็น แต่จะแสดงอาการในระยะอัมพาตเด่นชัด"),
        tags$p("แมว อาการคล้ายสุนัขแต่ไม่ชัดเจนและพบอาการแบบดุร้ายมากกว่าแบบซึม สุนัขและแมวที่เป็น โรคพิษสุนัขบ้าจะแสดงอาการป่วยจนกระทั้งตายไม่เกิน 10 วัน"),
        tags$p("โค กระบือ อาการจะตื่นเต้น กระสับกระส่าย เดินโซเซ มักมีอาการคล้ายมีอะไรติดคอ น้ำลายไหลยืด ท้องอืดป่อง อัมพาตและตาย"),
        
        tags$h3("อาการที่พบในคน"),
        tags$p("สำหรับอาการของคนที่ได้รับเชื้อโรคพิษสุนัขบ้า ส่วนใหญ่มีอาการของสมองอักเสบและไขสันหลังอักเสบ โดยอาการเริ่มแรกของผู้ป่วยจะมีไข้ต่ำๆ เจ็บคอ เบื่ออาหาร อ่อนเพลีย ต่อมามีอาการคัน มักเริ่มจากบริเวณแผลที่ถูกกัด แสบๆ ร้อนๆ แล้วลามไปส่วนอื่น บางคนคันมากเกาจนกลายเป็นแผลอักเสบ มีน้ำเหลือง ต่อมาจะกระสับกระส่าย กลัวแสงกลัวลม ไม่ชอบเสียงดัง เพ้อเจ้อ หลุกหลิก กระวนกระวาย หนาวสั่น ตามักเบิกโพลงบ่อยๆ บางครั้งเข้าใจผิดคิดว่าเป็นโรคทางจิต มีอาการกลืนลำบากโดยเฉพาะอย่างยิ่งของเหลว จะเกิดอาการปวดเกร็งทำให้ไม่อยากดื่มน้ำมีอาการกลัวน้ำ จึงมีชื่อเรียกอีกชื่อหนึ่งว่า โรคกลัวน้ำ ไม่อยากกลืนแม้กระทั่งน้ำลาย จึงทำให้น้ำลายไหล บางคนอาจปวดท้องน้อยและขา คนไข้เพศชายบางรายมีน้ำอสุจิไหลออกมาโดยไม่รู้ตัว กล้ามเนื้อกระตุก แน่นหน้าอก หายใจไม่ออกหรืออาจชักเกร็ง อัมพาต หมดสติและตายในที่สุด"),
        
        tags$h3("เมื่อถูกกัดทำอย่างไร"),
        tags$p("ถ้าถูกสุนัขบ้ากัด หรือสงสัยว่าบ้ากัด ข่วน หรือเลียตามบาดแผล ให้รีบล้างแผลให้เร็วที่สุดด้วยสบู่และน้ำสะอาดหลายๆ ครั้ง ซึ่งเป็นวิธีที่ดีที่สุดในการป้องกันการติดเชื้อ เพราะจะทำให้เชื้อโรคต่างๆ ที่บริเวณนั้นหลุดออกจากแผลไปตามน้ำ ไม่ว่าจะเป็นเชื้อโรคพิษสุนัขบ้า หรือเชื้อโรคอื่นๆ เช็ดแผลให้แห้ง ใส่ยาฆ่าเชื้อ เช่น โพวิโดนไอโอดีน ถ้าไม่มีอาจใช้แอลกอฮอล์ 70% หรือทิงเจอร์ไอโอดีน หรือยาฆ่าเชื้ออื่นๆ แทน"),
        tags$p("ต้องจดจำลักษณะและสังเกตอาการสัตว์ที่กัด รวมทั้งติดตามสืบหาเจ้าของเพื่อซักถามประวัติการฉีดวัคซีนป้องกันโรคพิษ สุนัขบ้า ที่มาของสัตว์และสังเกตอาการสัตว์ที่กัด 10 วัน (สุนัขคอกเดียวกัน พันธุ์เดียวกัน สีเดียวกัน ลักษณะคล้ายคลึงกัน อาจจำผิดตัวได้)"),
        tags$p("ไปพบแพทย์เพื่อรับการป้องกันรักษาที่ถูกต้อง ถ้ามีความเสี่ยงต่อโรคพิษสุนัขบ้า แพทย์จะฉีดวัคซีนป้องกันโรคพิษสุนัขบ้าให้"),
        
        tags$h3("วัคซีนป้องกันโรคพิษสุนัขบ้าในปัจจุบัน"),
        tags$p("วัคซีนโรคพิษสุนัขบ้าที่ใช้ฉีดคนในปัจจุบันไม่ต้องฉีดรอบสะดือทุกวันเหมือนแต่ก่อนแล้ว ฉีดเพียง 4 – 5 เข็ม ฉีดได้ทั้งในเด็กและสตรีมีครรภ์"),
        
        tags$div(class="center",
        tags$img(class="logo",
            src="image/logo-MU.jpg" 
                 ,alt="mahidol"),
        
        tags$img(class="logo",
                 src="image/MPH.jpg" 
                    ,alt="mahidol"),
        tags$img(class="logo",
                 src="image/Chulalongkorn-University-logo.png" 
                 ,alt="mahidol"),
        tags$img(class="logo2",
                 src="image/nstda.png" 
                 ,alt="mahidol"),
        tags$img(class="logo",
                 src="image/logo_DLD.jpg" 
                 ,alt="mahidol"),
        tags$img(class="logo3",
                 src="image/MORU_FS_RGB.png" 
                 ,alt="mahidol"),
         ),
    
        
        tags$h3("ผู้รับผิดชอบโครงการและคณะผู้วิจัย"),
        tags$ol(type = "1",
                tags$li("ผศ.ดร.อนุวัตน์ วิรัชสุดากุล"),
                tags$li("ผศ.ดร.ชรินทร์ โหมดชัง"),
                tags$li("รศ.ดร.อรุณรักษ์ คูเปอร์ มีใย"),
                tags$li("รศ.ดร.วิริชดา ปานงาม"),
                tags$li("ผศ.ดร.ศรินทร์ สุวรรณภักดี"),
                tags$li("ดร.วีรพงษ์ ธนพงศ์ธรรม"),
                tags$li("ดร.ศิษฎ์ เปรมัษเฐียร"),
        ),
        ),
        tabPanel("Mathematical model",
                 tags$h2("Mathematical model"),
                 tags$h3("Age structure model"),
                 tags$div(class="center",
                          tags$img(class="modelimage", src="image/Model.png" 
                                   ,alt="model"),
                 ),
                
        tags$h3("Dog dynamics model"),
        tags$div(class="center",
                 tags$img( 
                     src="image/DogDynamicsModel.png" 
                           ,alt="Dog Dynamics Model"),
        ),
        tags$h3("Dog sterilization model"),
        tags$div(
                 tags$img(
                     src="image/DogDynamicsModel.png" 
                           ,alt="model"),
        ),
        ),
       
        tabPanel("Demography",
                 source("./www/PopInput.R", local = TRUE)$value,
                 ),
        tabPanel("Sterilization",
                 source("./www/SterInput.R", local = TRUE)$value,
        ),
        tabPanel("Vaccination",
                 source("./www/VacInput.R", local = TRUE)$value,
        ),
        tabPanel("Model predictions",
                 actionButton("run","Run"),
                 tabsetPanel(
                     tabPanel("Dog population",
                              use_busy_spinner(spin = "fading-circle"),
                              tags$div(class = "col-sm-6",
                                       tags$h1("Indoor"),
                                       # withSpinner(plotlyOutput("PopIndoorPlot"), type = 5, color = "#0dc5c1", size = 2)
                                       plotOutput("PopIndoorPlot")
                              ),
                              tags$div(class = "col-sm-6",
                                       tags$h1("Outdoor"),
                                       # withSpinner(plotlyOutput("PopOutdoorPlot"), type = 5, color = "#0dc5c1", size = 2)
                                       plotOutput("PopOutdoorPlot")
                              ),
                              tags$div(class = "col-sm-6",
                                       tags$h1("Stray"),
                                       # withSpinner(plotlyOutput("PopStrayPlot"), type = 5, color = "#0dc5c1", size = 2)
                                       plotOutput("PopStrayPlot")
                              ),
                              tags$div(class = "col-sm-6",
                                       tags$h1("TotalPop"),
                                       # withSpinner(plotlyOutput("TotalPop"), type = 5, color = "#0dc5c1", size = 2)
                                       plotOutput("TotalPop")

                              ),
                              # tags$div(class = "col-sm-12",
                              # DT::dataTableOutput("table"),
                              # )
                              ),
                     tabPanel("Sterilization",
                              tags$h1("Indoor dog Sterilization"),
                              plotlyOutput("SterilizationPlot"),
                              tags$h1("Outdoor dog Sterilization"),
                              plotlyOutput("SterilizationPlot2"),
                              tags$h1("Stray dog Sterilization"),
                              plotlyOutput("SterilizationPlot3"),
                              ),
                     tabPanel("Vaccination",
                              plotlyOutput("")
                     ),
                     tabPanel("Rabies")
                 ),
                 ),
        tabPanel("Cost",
                 tabsetPanel(
                     tabPanel("Interventions"),
                     tabPanel("Cost of dogs"),
                     tabPanel("Cost of biting"),
                     tabPanel("Burdens")
                 ),),
        tabPanel("Economic analysis",
                 tags$h1("Scenario comparison")
                 )
        
    ),


))
